#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(_)
    ЭтотОбъект.ФормаИсходныйТекст = "Просто текст [ПАРАМЕТР] для замены";
    ЭтотОбъект.ФормаШаблонВыражения = "(?i)\[Параметр[0-9]*\]";
    ЭтотОбъект.ФормаТекстЗамены = "ЗНАЧЕНИЕ_ПАРАМЕТРА";
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаменитьТекст(_)
	ЗаменитьТекстНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаменитьТекстНаСервере()
	РегВыраженияВК = ВК_РегВыражения.НовыйОбъект();

    РегВыраженияВК = Новый("Addin.РегулярныеВыражения.RegExp");
    результатЗамены = РегВыраженияВК.ЗаменитьТекст(
            ЭтотОбъект.ФормаИсходныйТекст, ЭтотОбъект.ФормаШаблонВыражения, ЭтотОбъект.ФормаТекстЗамены,
            ЭтотОбъект.ФормаИскатьВсеСоответствия);

    ЭтотОбъект.ФормаРезультатТекст = результатЗамены;
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы