#Область ПрограммныйИнтерфейс

Функция НовыйОбъект() Экспорт
	// Установка, подключение, создание компоненты
	результатПодключения = подключить();
	Если результатПодключения.Успех = Ложь Тогда
		ВызватьИсключение(результатПодключения.ТекстОшибки);
	КонецЕсли;

    РегВыраженияВК = Новый("Addin.РегулярныеВыражения.RegExp");
	Возврат РегВыраженияВК;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция подключить()
    результат = Новый Структура("Успех, ТекстОшибки", Истина, "");

    подключено = ПодключитьВнешнююКомпоненту(
            УправлениеВК.ПолучитьПуть("РегулярныеВыражения"),
            "РегулярныеВыражения", ТипВнешнейКомпоненты.Native);

    Если подключено = Ложь Тогда
        результат.Успех = Ложь;
        результат.ТекстОшибки = "Ошибка подключение внешней компоненты: ""РегулярныеВыражения"".";

        Возврат результат;
    КонецЕсли;

    Возврат результат;
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции