#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(_)
    ЭтотОбъект.ФормаИсходныйТекст = "Просто текст [ПАРАМЕТР] для замены";
    ЭтотОбъект.ФормаШаблонВыражения = "(?i)\[Параметр[0-9]*\]";
    ЭтотОбъект.ФормаТекстЗамены = "ЗНАЧЕНИЕ_ПАРАМЕТРА";
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ЗаменитьТекст(_)
    результатПодключения = Ждать подключить(
            "/mnt/SSD_2TB_2023/git/onec/addins/regexp-addin/target/debug/libregexp_addin.so",
            "РегулярныеВыражения");
    Если результатПодключения.Успех = Ложь Тогда
        сообщение = Новый СообщениеПользователю;
        сообщение.Текст = результатПодключения.ТекстОшибки;
        сообщение.Сообщить();
        Возврат;
    КонецЕсли;

    РегВыраженияВК = Новый("Addin.РегулярныеВыражения.RegExp");
    результатЗамены = Ждать РегВыраженияВК.ЗаменитьТекстАсинх(
            ЭтотОбъект.ФормаИсходныйТекст, ЭтотОбъект.ФормаШаблонВыражения, ЭтотОбъект.ФормаТекстЗамены,
            ЭтотОбъект.ФормаИскатьВсеСоответствия);

    ЭтотОбъект.ФормаРезультатТекст = результатЗамены.Значение;
КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Асинх Функция подключить(Знач путьФайла, имяВК)
    результат = Новый Структура("Успех, ТекстОшибки", Истина, "");

    подключено = Ждать ПодключитьВнешнююКомпонентуАсинх(
            путьФайла,
            имяВК, ТипВнешнейКомпоненты.Native);

    Если подключено = Ложь Тогда
        результат.Успех = Ложь;
        результат.ТекстОшибки = "Ошибка подключение внешней компоненты";

        Возврат результат;
    КонецЕсли;

    Возврат результат;
КонецФункции

#КонецОбласти
